aerospike_cassandra_ycsb/cassandra_data/workloada_output
YCSB Client 0.1
Command line: -db com.yahoo.ycsb.db.CassandraClient10 -P workloads/workloada -p cassandra.connectionretries=10 -p fieldlength=10 -p updateretrycount=100 -p cassandra.operationretries=10 -p recordcount=50000000 -p reconnectiontime=1000 -p fieldcount=10 -p timeseries.granularity=100 -p threadcount=32 -p insertretrycount=10 -p readretrycount=1000 -p ignoreinserterrors=true -p hosts=f1,f2,f3,f4 -p maxexecutiontime=60 -p measurementtype=timeseries -p exportmeasurementsinterval=30000 -p operationcount=60000000 -t
[OVERALL], RunTime(ms), 60003.0
[OVERALL], Throughput(ops/sec), 310818.809059547
[UPDATE], Operations, 9327988
[UPDATE], AverageLatency(us), 90.51074175910175
[UPDATE], MinLatency(us), 45
[UPDATE], MaxLatency(us), 144941
[UPDATE], Return=0, 9327210
[UPDATE], 0, 563.8667606626718
[UPDATE], 100, 341.58948934060487
[UPDATE], 200, 304.64867109634554
[UPDATE], 300, 291.1464686998395
[UPDATE], 400, 278.44140985421666
[UPDATE], 500, 242.75796812749005
[UPDATE], 600, 209.06420021762784
[UPDATE], 700, 191.12097238204834
[UPDATE], 800, 188.4986473017229
[UPDATE], 900, 177.09126984126985
[UPDATE], 1000, 157.40562521179262
[UPDATE], 1100, 151.98537277589782
[UPDATE], 1200, 127.8010073079202
[UPDATE], 1300, 124.82723096199359
[UPDATE], 1400, 194.53627563235142
[UPDATE], 1500, 105.0357834469984
[UPDATE], 1600, 99.88500667111407
[UPDATE], 1700, 98.63090748615903
[UPDATE], 1800, 105.40986687548943
[UPDATE], 1900, 108.72894524664663
[UPDATE], 2000, 109.16626079256143
[UPDATE], 2100, 113.85229466805288
[UPDATE], 2200, 102.77444723780056
[UPDATE], 2300, 101.1660946707246
[UPDATE], 2400, 95.45202532423627
[UPDATE], 2500, 91.52027626409834
[UPDATE], 2600, 90.97202204323867
[UPDATE], 2700, 85.1988307478583
[UPDATE], 2800, 84.96166356877323
[UPDATE], 2900, 83.2533356140951
[UPDATE], 3000, 83.8482004031097
[UPDATE], 3100, 84.73000729217307
[UPDATE], 3200, 83.18611428571428
[UPDATE], 3300, 83.6037127171883
[UPDATE], 3400, 83.4962684441406
[UPDATE], 3500, 83.878908470722
[UPDATE], 3600, 85.0993615786419
[UPDATE], 3700, 83.34736425786768
[UPDATE], 3800, 85.25260778859527
[UPDATE], 3900, 82.10869986436737
[UPDATE], 4000, 110.64308967150045
[UPDATE], 4100, 84.39620026563493
[UPDATE], 4200, 96.51558355437666
[UPDATE], 4300, 83.79207469824641
[UPDATE], 4400, 83.36806741828948
[UPDATE], 4500, 83.74566929133859
[UPDATE], 4600, 82.9166430715216
[UPDATE], 4700, 84.52119254944928
[UPDATE], 4800, 83.75537161970634
[UPDATE], 4900, 84.45839064649243
[UPDATE], 5000, 83.29043208100799
[UPDATE], 5100, 85.26918824556299
[UPDATE], 5200, 83.07727816720806
[UPDATE], 5300, 84.94722894342667
[UPDATE], 5400, 83.27243699395598
[UPDATE], 5500, 84.84007384757399
[UPDATE], 5600, 83.18318437980304
[UPDATE], 5700, 84.06712336653042
[UPDATE], 5800, 83.43664939354251
[UPDATE], 5900, 93.94525959367945
[UPDATE], 6000, 83.55178854426082
[UPDATE], 6100, 84.04713514754852
[UPDATE], 6200, 130.23501588943907
[UPDATE], 6300, 84.05296782436984
[UPDATE], 6400, 94.37373603859626
[UPDATE], 6500, 86.99215226939971
[UPDATE], 6600, 82.04681770560502
[UPDATE], 6700, 108.97816437571592
[UPDATE], 6800, 83.5026043157232
[UPDATE], 6900, 83.5967344600401
[UPDATE], 7000, 83.68564973060657
[UPDATE], 7100, 83.44877013932687
[UPDATE], 7200, 84.19116310767834
[UPDATE], 7300, 83.81344480073294
[UPDATE], 7400, 83.65673276458381
[UPDATE], 7500, 84.20799768183136
[UPDATE], 7600, 84.58847473396523
[UPDATE], 7700, 83.46935372585097
[UPDATE], 7800, 83.8209706959707
[UPDATE], 7900, 84.04487776484284
[UPDATE], 8000, 84.16154688490577
[UPDATE], 8100, 83.61775599749274
[UPDATE], 8200, 83.22980638796399
[UPDATE], 8300, 100.90822166857451
[UPDATE], 8400, 83.61247076273604
[UPDATE], 8500, 84.11562698733884
[UPDATE], 8600, 83.92987611639298
[UPDATE], 8700, 84.30121107266436
[UPDATE], 8800, 83.5729832440836
[UPDATE], 8900, 84.06844283798752
[UPDATE], 9000, 83.9428653295129
[UPDATE], 9100, 84.089217832047
[UPDATE], 9200, 83.82895113707968
[UPDATE], 9300, 81.38232415046846
[UPDATE], 9400, 160.95007247543887
[UPDATE], 9500, 84.714865962632
[UPDATE], 9600, 83.99931957359945
[UPDATE], 9700, 90.5837474054972
[UPDATE], 9800, 85.7577850687849
[UPDATE], 9900, 101.5729946173034
[UPDATE], 10000, 90.82775814188336
[UPDATE], 10100, 89.6943380161771
[UPDATE], 10200, 84.16645584176634
[UPDATE], 10300, 83.44915824915824
[UPDATE], 10400, 105.53863542951089
[UPDATE], 10500, 84.1853826311264
[UPDATE], 10600, 84.13151604825859
[UPDATE], 10700, 83.99108426804716
[UPDATE], 10800, 84.0197904540163
[UPDATE], 10900, 83.92995169082126
[UPDATE], 11000, 84.17831187410586
[UPDATE], 11100, 84.82549212030248
[UPDATE], 11200, 85.05085242252036
[UPDATE], 11300, 83.82495247969587
[UPDATE], 11400, 84.17541628122109
[UPDATE], 11500, 84.30568693044181
[UPDATE], 11600, 84.68895899053628
[UPDATE], 11700, 84.84585764294049
[UPDATE], 11800, 84.48096295031586
[UPDATE], 11900, 86.15974761174667
[UPDATE], 12000, 82.96569543020794
[UPDATE], 12100, 121.6354123922856
[UPDATE], 12200, 84.49942673698693
[UPDATE], 12300, 85.15226118786161
[UPDATE], 12400, 82.81373255585403
[UPDATE], 12500, 107.4673962313022
[UPDATE], 12600, 84.68028242983019
[UPDATE], 12700, 84.28706461961504
[UPDATE], 12800, 85.34854238476369
[UPDATE], 12900, 83.45168165168165
[UPDATE], 13000, 84.62976722586637
[UPDATE], 13100, 84.67539816813488
[UPDATE], 13200, 84.61075529398188
[UPDATE], 13300, 84.22191445503736
[UPDATE], 13400, 97.28688912554728
[UPDATE], 13500, 84.76162723600693
[UPDATE], 13600, 85.1876096876097
[UPDATE], 13700, 84.85280018706887
[UPDATE], 13800, 83.83874912648497
[UPDATE], 13900, 83.59752107713602
[UPDATE], 14000, 109.16159531260404
[UPDATE], 14100, 85.15502645502646
[UPDATE], 14200, 83.2719159440471
[UPDATE], 14300, 92.20159540523292
[UPDATE], 14400, 85.06
[UPDATE], 14500, 89.04671146142913
[UPDATE], 14600, 112.12577410793277
[UPDATE], 14700, 88.95854759814374
[UPDATE], 14800, 84.81291041275797
[UPDATE], 14900, 87.89613300952736
[UPDATE], 15000, 85.94455066921606
[UPDATE], 15100, 85.16328582411734
[UPDATE], 15200, 89.70294446515095
[UPDATE], 15300, 85.2680587237527
[UPDATE], 15400, 91.07951701701701
[UPDATE], 15500, 85.65258410965407
[UPDATE], 15600, 89.72319832316133
[UPDATE], 15700, 85.75503736920777
[UPDATE], 15800, 89.38533358065912
[UPDATE], 15900, 85.59379449454201
[UPDATE], 16000, 90.67818080701971
[UPDATE], 16100, 86.52376113336123
[UPDATE], 16200, 91.34427940093298
[UPDATE], 16300, 85.75868055555556
[UPDATE], 16400, 85.46744059495737
[UPDATE], 16500, 110.3567700987306
[UPDATE], 16600, 85.58789642475354
[UPDATE], 16700, 147.95144335057566
[UPDATE], 16800, 111.00509852556152
[UPDATE], 16900, 90.69446192573946
[UPDATE], 17000, 85.65770374776919
[UPDATE], 17100, 86.36448261365683
[UPDATE], 17200, 89.91051384385133
[UPDATE], 17300, 86.2998016946097
[UPDATE], 17400, 90.87391304347825
[UPDATE], 17500, 85.90585911784069
[UPDATE], 17600, 87.16841663166737
[UPDATE], 17700, 86.5397913561848
[UPDATE], 17800, 84.9923273657289
[UPDATE], 17900, 85.45292800754095
[UPDATE], 18000, 85.95794027519077
[UPDATE], 18100, 84.39837837837838
[UPDATE], 18200, 85.22317979197622
[UPDATE], 18300, 83.79773982278157
[UPDATE], 18400, 95.91761692786146
[UPDATE], 18500, 85.38377179840595
[UPDATE], 18600, 84.86076397076161
[UPDATE], 18700, 85.34846581733358
[UPDATE], 18800, 84.00459447386893
[UPDATE], 18900, 106.46073717948718
[UPDATE], 19000, 85.33468009407224
[UPDATE], 19100, 85.33761884829278
[UPDATE], 19200, 85.69671638200626
[UPDATE], 19300, 85.28450005902491
[UPDATE], 19400, 85.1128965312778
[UPDATE], 19500, 85.10518876258908
[UPDATE], 19600, 85.61128974633797
[UPDATE], 19700, 85.32489601901366
[UPDATE], 19800, 85.4371239649729
[UPDATE], 19900, 86.31357151420693
[UPDATE], 20000, 85.36695846307502
[UPDATE], 20100, 84.07900943396227
[UPDATE], 20200, 128.84096440523274
[UPDATE], 20300, 84.47960055186913
[UPDATE], 20400, 100.62504543802254
[UPDATE], 20500, 87.10508752046341
[UPDATE], 20600, 87.15413556647854
[UPDATE], 20700, 86.69660132382892
[UPDATE], 20800, 117.02417096536477
[UPDATE], 20900, 87.74712858926343
[UPDATE], 21000, 87.32800147085861
[UPDATE], 21100, 93.09573863636363
[UPDATE], 21200, 85.10464063725786
[UPDATE], 21300, 92.19886653082017
[UPDATE], 21400, 85.52220216606499
[UPDATE], 21500, 85.56355263987889
[UPDATE], 21600, 89.84645201625509
[UPDATE], 21700, 84.54484794045939
[UPDATE], 21800, 92.69412053516632
[UPDATE], 21900, 90.83958594730238
[UPDATE], 22000, 85.38067976377003
[UPDATE], 22100, 83.74724046388151
[UPDATE], 22200, 126.3273311897106
[UPDATE], 22300, 85.67102657946842
[UPDATE], 22400, 91.16247124968055
[UPDATE], 22500, 85.0627261761158
[UPDATE], 22600, 93.7762174697243
[UPDATE], 22700, 85.60111617858857
[UPDATE], 22800, 89.59639604727766
[UPDATE], 22900, 94.03843470539735
[UPDATE], 23000, 86.01821898863568
[UPDATE], 23100, 91.81278309008556
[UPDATE], 23200, 86.62780598201725
[UPDATE], 23300, 91.41394053248688
[UPDATE], 23400, 85.90496616723054
[UPDATE], 23500, 86.04597629444791
[UPDATE], 23600, 90.73950925747965
[UPDATE], 23700, 86.051215917465
[UPDATE], 23800, 127.08165650830759
[UPDATE], 23900, 96.17905685661412
[UPDATE], 24000, 91.62645516182678
[UPDATE], 24100, 86.61801680260011
[UPDATE], 24200, 116.38545719844358
[UPDATE], 24300, 89.79883270950961
[UPDATE], 24400, 85.89516570386135
[UPDATE], 24500, 93.33807073954983
[UPDATE], 24600, 85.6118790366391
[UPDATE], 24700, 87.10259212043951
[UPDATE], 24800, 85.41767331151443
[UPDATE], 24900, 86.26970174587778
[UPDATE], 25000, 85.82386851465718
[UPDATE], 25100, 85.25533823793289
[UPDATE], 25200, 88.0016875928176
[UPDATE], 25300, 84.7031450120962
[UPDATE], 25400, 103.61528931642617
[UPDATE], 25500, 85.54452329941081
[UPDATE], 25600, 84.58663349694076
[UPDATE], 25700, 85.71536590176869
[UPDATE], 25800, 86.0368032991752
[UPDATE], 25900, 85.82370443838333
[UPDATE], 26000, 85.67630522088353
[UPDATE], 26100, 84.96912216083487
[UPDATE], 26200, 84.54274569985293
[UPDATE], 26300, 98.70793943586196
[UPDATE], 26400, 86.14256198347107
[UPDATE], 26500, 85.21034524384355
[UPDATE], 26600, 85.86021570897569
[UPDATE], 26700, 86.11233196243325
[UPDATE], 26800, 85.30657693484245
[UPDATE], 26900, 86.99491857475205
[UPDATE], 27000, 98.36845412651864
[UPDATE], 27100, 85.94142927308448
[UPDATE], 27200, 85.37199203908088
[UPDATE], 27300, 84.80059924177571
[UPDATE], 27400, 108.2528847716561
[UPDATE], 27500, 85.53236889692586
[UPDATE], 27600, 85.15776112185686
[UPDATE], 27700, 85.95685294655372
[UPDATE], 27800, 85.32255725421476
[UPDATE], 27900, 86.34219998779818
[UPDATE], 28000, 85.8830901495429
[UPDATE], 28100, 85.94931096464948
[UPDATE], 28200, 85.28377718055216
[UPDATE], 28300, 86.24685505925251
[UPDATE], 28400, 115.26643066030475
[UPDATE], 28500, 85.19263803680981
[UPDATE], 28600, 103.76828737300436
[UPDATE], 28700, 85.31292805624584
[UPDATE], 28800, 88.09954637096774
[UPDATE], 28900, 85.75427504816956
[UPDATE], 29000, 87.65487055317564
[UPDATE], 29100, 85.57464126371639
[UPDATE], 29200, 86.32374502982107
[UPDATE], 29300, 91.12613547884766
[UPDATE], 29400, 86.16912613104998
[UPDATE], 29500, 86.17818842774916
[UPDATE], 29600, 85.6542203843347
[UPDATE], 29700, 86.20417197259111
[UPDATE], 29800, 86.00698281620014
[UPDATE], 29900, 85.89182968929805
[UPDATE], 30000, 86.18176842617368
[UPDATE], 30100, 85.76974605687839
[UPDATE], 30200, 84.65934714210802
[UPDATE], 30300, 113.97568204782755
[UPDATE], 30400, 85.46602985074627
[UPDATE], 30500, 83.568875017733
[UPDATE], 30600, 102.30665532360447
[UPDATE], 30700, 85.82701652089408
[UPDATE], 30800, 85.58297090352221
[UPDATE], 30900, 85.69186189889025
[UPDATE], 31000, 105.68185285347757
[UPDATE], 31100, 83.9581463825014
[UPDATE], 31200, 86.08940136795593
[UPDATE], 31300, 86.96217479549787
[UPDATE], 31400, 86.30693312082389
[UPDATE], 31500, 100.65522476731137
[UPDATE], 31600, 86.7960542540074
[UPDATE], 31700, 88.1423040899157
[UPDATE], 31800, 86.57095954903053
[UPDATE], 31900, 117.0508157052533
[UPDATE], 32000, 96.54871317417037
[UPDATE], 32100, 86.29929007348362
[UPDATE], 32200, 87.06350216340036
[UPDATE], 32300, 86.04595441420409
[UPDATE], 32400, 89.35994723286639
[UPDATE], 32500, 86.28449975357319
[UPDATE], 32600, 90.44086525582641
[UPDATE], 32700, 126.96649693749539
[UPDATE], 32800, 87.43592063594649
[UPDATE], 32900, 86.79586756285785
[UPDATE], 33000, 90.65298341488213
[UPDATE], 33100, 88.3862698511942
[UPDATE], 33200, 85.28588750421017
[UPDATE], 33300, 106.445294617749
[UPDATE], 33400, 86.08060453400503
[UPDATE], 33500, 95.69349256972247
[UPDATE], 33600, 92.12206747598123
[UPDATE], 33700, 97.92278247096093
[UPDATE], 33800, 86.9757979872816
[UPDATE], 33900, 91.11095917171322
[UPDATE], 34000, 86.06098099867432
[UPDATE], 34100, 87.73640972979912
[UPDATE], 34200, 93.29942331367847
[UPDATE], 34300, 86.41940148371684
[UPDATE], 34400, 91.2568765775678
[UPDATE], 34500, 86.52307310104962
[UPDATE], 34600, 93.18347639484979
[UPDATE], 34700, 86.03842601145391
[UPDATE], 34800, 95.53206556333545
[UPDATE], 34900, 101.30320718409237
[UPDATE], 35000, 90.4632333596422
[UPDATE], 35100, 87.79661762856783
[UPDATE], 35200, 87.93667064964468
[UPDATE], 35300, 111.31924847204407
[UPDATE], 35400, 89.5300780750032
[UPDATE], 35500, 85.19310136157337
[UPDATE], 35600, 86.33970130678283
[UPDATE], 35700, 86.6055297731878
[UPDATE], 35800, 89.84692302530031
[UPDATE], 35900, 86.98885115653232
[UPDATE], 36000, 89.8578063106133
[UPDATE], 36100, 87.08530338849488
[UPDATE], 36200, 90.0308849117574
[UPDATE], 36300, 85.43037192635612
[UPDATE], 36400, 85.8429757185332
[UPDATE], 36500, 85.41155167030908
[UPDATE], 36600, 85.62057225168599
[UPDATE], 36700, 86.27324564245448
[UPDATE], 36800, 86.0150361507454
[UPDATE], 36900, 85.2070415133999
[UPDATE], 37000, 167.1900011336583
[UPDATE], 37100, 86.03949367088607
[UPDATE], 37200, 86.0231568406559
[UPDATE], 37300, 85.47412763281987
[UPDATE], 37400, 85.98056262808173
[UPDATE], 37500, 87.85893945287178
[UPDATE], 37600, 86.13896372407744
[UPDATE], 37700, 85.44395726548508
[UPDATE], 37800, 86.26044119469574
[UPDATE], 37900, 85.38915520139452
[UPDATE], 38000, 86.70854711550494
[UPDATE], 38100, 85.4283325074331
[UPDATE], 38200, 86.14790094192502
[UPDATE], 38300, 86.35461765082619
[UPDATE], 38400, 89.6087595139538
[UPDATE], 38500, 85.90698856416772
[UPDATE], 38600, 94.11581093132884
[UPDATE], 38700, 83.34253623188405
[UPDATE], 38800, 112.19163650465357
[UPDATE], 38900, 107.68511229451262
[UPDATE], 39000, 85.2475385003787
[UPDATE], 39100, 86.24981151042975
[UPDATE], 39200, 100.25813065610859
[UPDATE], 39300, 86.13146011038636
[UPDATE], 39400, 91.48019112084411
[UPDATE], 39500, 86.81358390616131
[UPDATE], 39600, 91.28739824161511
[UPDATE], 39700, 86.56227175418714
[UPDATE], 39800, 91.90911475409835
[UPDATE], 39900, 86.75312834056467
[UPDATE], 40000, 90.67894979272225
[UPDATE], 40100, 86.44532245730308
[UPDATE], 40200, 91.51053324555629
[UPDATE], 40300, 86.36445004727388
[UPDATE], 40400, 90.12896976406283
[UPDATE], 40500, 103.32057130038136
[UPDATE], 40600, 92.78997798782856
[UPDATE], 40700, 87.00452344546382
[UPDATE], 40800, 92.80426356589147
[UPDATE], 40900, 91.65527122484339
[UPDATE], 41000, 101.18087088537713
[UPDATE], 41100, 90.78455526856084
[UPDATE], 41200, 101.5526025888185
[UPDATE], 41300, 94.20295350229495
[UPDATE], 41400, 85.79044278825077
[UPDATE], 41500, 114.42760283260509
[UPDATE], 41600, 86.66343312347423
[UPDATE], 41700, 97.48846465688804
[UPDATE], 41800, 103.16947785274274
[UPDATE], 41900, 85.4527498836204
[UPDATE], 42000, 105.72477064220183
[UPDATE], 42100, 86.87618925173567
[UPDATE], 42200, 92.67358100446876
[UPDATE], 42300, 85.05217557495062
[UPDATE], 42400, 84.60103192518542
[UPDATE], 42500, 95.18865148861646
[UPDATE], 42600, 84.94096339603458
[UPDATE], 42700, 96.81212204507972
[UPDATE], 42800, 86.02604100343818
[UPDATE], 42900, 89.22865501054494
[UPDATE], 43000, 85.84224939498154
[UPDATE], 43100, 89.99736735520453
[UPDATE], 43200, 85.26724801231084
[UPDATE], 43300, 85.38176601017346
[UPDATE], 43400, 91.9068057226902
[UPDATE], 43500, 86.1762331272865
[UPDATE], 43600, 96.93094423193074
[UPDATE], 43700, 84.62789674391317
[UPDATE], 43800, 107.4561691791098
[UPDATE], 43900, 93.79798050139276
[UPDATE], 44000, 95.84383681824828
[UPDATE], 44100, 102.36674536256324
[UPDATE], 44200, 86.17360801071497
[UPDATE], 44300, 94.81092122285014
[UPDATE], 44400, 86.25991949396204
[UPDATE], 44500, 94.13656953552837
[UPDATE], 44600, 85.94660968297507
[UPDATE], 44700, 90.71081949285764
[UPDATE], 44800, 86.34349030470914
[UPDATE], 44900, 84.83507014028056
[UPDATE], 45000, 93.53929643107962
[UPDATE], 45100, 85.89499243188698
[UPDATE], 45200, 90.729513747799
[UPDATE], 45300, 86.25819882141943
[UPDATE], 45400, 92.95850594227504
[UPDATE], 45500, 86.3773766700925
[UPDATE], 45600, 87.03933721224386
[UPDATE], 45700, 113.2729711602951
[UPDATE], 45800, 85.05973326654562
[UPDATE], 45900, 85.1514148291586
[UPDATE], 46000, 84.67585726056919
[UPDATE], 46100, 86.62455085908408
[UPDATE], 46200, 83.38570252469813
[UPDATE], 46300, 85.20984257007551
[UPDATE], 46400, 84.42809927662759
[UPDATE], 46500, 83.38028965030024
[UPDATE], 46600, 95.2568290215349
[UPDATE], 46700, 95.7965293668955
[UPDATE], 46800, 84.60562849425216
[UPDATE], 46900, 85.18465424692138
[UPDATE], 47000, 85.71329162410623
[UPDATE], 47100, 84.15624403588015
[UPDATE], 47200, 84.82564622402433
[UPDATE], 47300, 84.9084235411223
[UPDATE], 47400, 108.49772560528247
[UPDATE], 47500, 84.8287531973503
[UPDATE], 47600, 102.73373352653005
[UPDATE], 47700, 84.83095582228367
[UPDATE], 47800, 84.99058133732535
[UPDATE], 47900, 85.7420657454729
[UPDATE], 48000, 85.6923271714358
[UPDATE], 48100, 85.12724399494311
[UPDATE], 48200, 85.18290598290598
[UPDATE], 48300, 84.94761423882858
[UPDATE], 48400, 84.56729685739326
[UPDATE], 48500, 84.52750546362785
[UPDATE], 48600, 84.67314855735842
[UPDATE], 48700, 86.06789653860784
[UPDATE], 48800, 85.07262429200755
[UPDATE], 48900, 83.25976454293628
[UPDATE], 49000, 106.7425259304454
[UPDATE], 49100, 83.53834472285497
[UPDATE], 49200, 107.72583421610169
[UPDATE], 49300, 85.79454406714994
[UPDATE], 49400, 82.57290411430539
[UPDATE], 49500, 113.27440633245382
[UPDATE], 49600, 85.18337286231431
[UPDATE], 49700, 85.32272839811834
[UPDATE], 49800, 85.73420656806218
[UPDATE], 49900, 85.11905509832255
[UPDATE], 50000, 85.79559510286508
[UPDATE], 50100, 85.7691920146105
[UPDATE], 50200, 84.98595825426945
[UPDATE], 50300, 83.59485815602837
[UPDATE], 50400, 101.07953081564852
[UPDATE], 50500, 85.77723463687151
[UPDATE], 50600, 87.64129815904346
[UPDATE], 50700, 85.94078534688245
[UPDATE], 50800, 85.53708472021604
[UPDATE], 50900, 102.07444880700695
[UPDATE], 51000, 85.29119696010133
[UPDATE], 51100, 85.99619795562204
[UPDATE], 51200, 85.49419079319223
[UPDATE], 51300, 85.80415782244974
[UPDATE], 51400, 85.8917675239536
[UPDATE], 51500, 85.7162153750389
[UPDATE], 51600, 85.08177833437696
[UPDATE], 51700, 86.18365300238185
[UPDATE], 51800, 95.03403553489767
[UPDATE], 51900, 85.50112261444431
[UPDATE], 52000, 85.78258694020515
[UPDATE], 52100, 84.98672897196262
[UPDATE], 52200, 85.89134834303061
[UPDATE], 52300, 106.33583834335337
[UPDATE], 52400, 117.22199078457363
[UPDATE], 52500, 85.13919911149503
[UPDATE], 52600, 85.83287223340041
[UPDATE], 52700, 96.54962394927001
[UPDATE], 52800, 85.87522146292078
[UPDATE], 52900, 85.61736414740787
[UPDATE], 53000, 85.62347666856097
[UPDATE], 53100, 85.97922829986781
[UPDATE], 53200, 84.00665660170189
[UPDATE], 53300, 112.93418962778814
[UPDATE], 53400, 85.9961781843243
[UPDATE], 53500, 86.27607868020304
[UPDATE], 53600, 86.19115423387096
[UPDATE], 53700, 85.4231449879914
[UPDATE], 53800, 86.21154452076375
[UPDATE], 53900, 86.48779408044523
[UPDATE], 54000, 85.90415844106222
[UPDATE], 54100, 85.61911846754695
[UPDATE], 54200, 85.75371602711611
[UPDATE], 54300, 85.2390781309358
[UPDATE], 54400, 86.34459798994975
[UPDATE], 54500, 83.00179144584608
[UPDATE], 54600, 103.22540431266846
[UPDATE], 54700, 83.44227049546198
[UPDATE], 54800, 105.54100511743866
[UPDATE], 54900, 85.84466203411245
[UPDATE], 55000, 86.167336523126
[UPDATE], 55100, 85.0306249590137
[UPDATE], 55200, 111.76560098370734
[UPDATE], 55300, 96.57691776088458
[UPDATE], 55400, 86.55597109533468
[UPDATE], 55500, 86.09568173234294
[UPDATE], 55600, 86.09979964938643
[UPDATE], 55700, 84.3608195902049
[UPDATE], 55800, 85.6948371426792
[UPDATE], 55900, 85.07716940851438
[UPDATE], 56000, 85.61859642473628
[UPDATE], 56100, 85.08992490613267
[UPDATE], 56200, 82.3465788510794
[UPDATE], 56300, 104.0975360740539
[UPDATE], 56400, 99.07825963113295
[UPDATE], 56500, 85.00056285178236
[UPDATE], 56600, 85.44361826338105
[UPDATE], 56700, 85.1795959092043
[UPDATE], 56800, 86.13160032493907
[UPDATE], 56900, 84.95707402540516
[UPDATE], 57000, 85.70976303317535
[UPDATE], 57100, 85.3562292460952
[UPDATE], 57200, 84.4533922019775
[UPDATE], 57300, 86.12312480547774
[UPDATE], 57400, 85.79537421715136
[UPDATE], 57500, 85.38839203108617
[UPDATE], 57600, 85.47974573102331
[UPDATE], 57700, 82.7280412988179
[UPDATE], 57800, 107.52811877370011
[UPDATE], 57900, 85.42612162247674
[UPDATE], 58000, 84.94703837502556
[UPDATE], 58100, 89.61025541041138
[UPDATE], 58200, 109.45363751051303
[UPDATE], 58300, 123.79817808570695
[UPDATE], 58400, 85.6315658296467
[UPDATE], 58500, 85.82727272727273
[UPDATE], 58600, 85.8783961026794
[UPDATE], 58700, 85.29962546816479
[UPDATE], 58800, 85.60282122048451
[UPDATE], 58900, 85.79062440929998
[UPDATE], 59000, 85.39091818864148
[UPDATE], 59100, 85.729088639201
[UPDATE], 59200, 83.21997921923705
[UPDATE], 59300, 100.71634370219276
[UPDATE], 59400, 85.42665250531051
[UPDATE], 59500, 86.02441019188424
[UPDATE], 59600, 86.11154708520179
[UPDATE], 59700, 85.94220012430081
[UPDATE], 59800, 86.83571740895746
[UPDATE], 59900, 85.94563563425093
[READ], Operations, 9322073
[READ], AverageLatency(us), 107.11630331579681
[READ], MinLatency(us), 48
[READ], MaxLatency(us), 144931
[READ], Return=0, 9321648
[READ], 0, 657.3192252510761
[READ], 100, 347.57968865826535
[READ], 200, 309.8618204283361
[READ], 300, 296.95793838862556
[READ], 400, 268.6122335495829
[READ], 500, 241.21506094506594
[READ], 600, 241.42732784082077
[READ], 700, 220.7003745318352
[READ], 800, 217.89385635996538
[READ], 900, 206.70067585131272
[READ], 1000, 192.85164466323562
[READ], 1100, 192.17185940791663
[READ], 1200, 183.77485852869847
[READ], 1300, 196.77237510018702
[READ], 1400, 219.5419602818706
[READ], 1500, 159.54319931565442
[READ], 1600, 162.49611683268614
[READ], 1700, 150.66472883650553
[READ], 1800, 137.41348314606742
[READ], 1900, 121.15822737750018
[READ], 2000, 116.60182282172804
[READ], 2100, 117.91559988091694
[READ], 2200, 98.23523227544517
[READ], 2300, 98.78267397832616
[READ], 2400, 95.75172890733057
[READ], 2500, 101.28376365441906
[READ], 2600, 95.02199003766249
[READ], 2700, 91.53500462107209
[READ], 2800, 92.72439392181882
[READ], 2900, 92.429673556336
[READ], 3000, 92.16150670794633
[READ], 3100, 101.84065733414485
[READ], 3200, 90.8793571751924
[READ], 3300, 91.04521489971347
[READ], 3400, 90.57087267525036
[READ], 3500, 91.04038263260396
[READ], 3600, 91.5737780333525
[READ], 3700, 90.64746925936517
[READ], 3800, 91.92391807451979
[READ], 3900, 89.80369396524081
[READ], 4000, 85.13100212594385
[READ], 4100, 142.22591862756462
[READ], 4200, 107.3542951907131
[READ], 4300, 91.32740621773546
[READ], 4400, 91.02855839936157
[READ], 4500, 91.45412763976962
[READ], 4600, 91.1602527610156
[READ], 4700, 92.42754929905183
[READ], 4800, 91.09897394512336
[READ], 4900, 91.45609671448403
[READ], 5000, 90.58309285350535
[READ], 5100, 92.42051163596466
[READ], 5200, 90.68699141048825
[READ], 5300, 91.24786862733879
[READ], 5400, 91.58741858073363
[READ], 5500, 92.85301638963152
[READ], 5600, 90.98911009018207
[READ], 5700, 91.4609969667487
[READ], 5800, 90.99755737332424
[READ], 5900, 96.9680944055944
[READ], 6000, 91.2382349557013
[READ], 6100, 91.92457420924575
[READ], 6200, 98.75825725525124
[READ], 6300, 91.892271119615
[READ], 6400, 102.5532176615305
[READ], 6500, 95.27930290843388
[READ], 6600, 90.2030113892285
[READ], 6700, 146.61762340036563
[READ], 6800, 91.49315619967794
[READ], 6900, 91.37946963216424
[READ], 7000, 91.73081939325206
[READ], 7100, 91.47719720407929
[READ], 7200, 91.68242228128973
[READ], 7300, 92.05114678899082
[READ], 7400, 91.25403776160145
[READ], 7500, 92.15388133074197
[READ], 7600, 93.08623280545602
[READ], 7700, 91.81693784855976
[READ], 7800, 92.05488436313428
[READ], 7900, 92.25108101957214
[READ], 8000, 91.53593276542222
[READ], 8100, 91.57377142857143
[READ], 8200, 91.39518042962332
[READ], 8300, 122.24740861974905
[READ], 8400, 91.51155588690715
[READ], 8500, 91.96991921159686
[READ], 8600, 91.66065911431514
[READ], 8700, 91.95416738369758
[READ], 8800, 91.57604497955475
[READ], 8900, 92.16074170980035
[READ], 9000, 92.08227267515193
[READ], 9100, 92.16998274870615
[READ], 9200, 92.53312557710065
[READ], 9300, 88.94233289646134
[READ], 9400, 144.9008702859511
[READ], 9500, 92.5850367710927
[READ], 9600, 92.23834590863895
[READ], 9700, 102.17768413107743
[READ], 9800, 91.54806354359926
[READ], 9900, 100.75449728527506
[READ], 10000, 100.47641096233262
[READ], 10100, 95.4291681801671
[READ], 10200, 92.53743393157926
[READ], 10300, 92.09986708554858
[READ], 10400, 118.38372496014418
[READ], 10500, 92.18092525863071
[READ], 10600, 92.47835725119589
[READ], 10700, 92.2997874662531
[READ], 10800, 92.22297721692458
[READ], 10900, 92.34876931883228
[READ], 11000, 92.14764750246563
[READ], 11100, 92.17154086232806
[READ], 11200, 93.07179990757855
[READ], 11300, 92.30828405763822
[READ], 11400, 92.57623111521163
[READ], 11500, 92.60528756957328
[READ], 11600, 92.87049894092728
[READ], 11700, 93.04228525215181
[READ], 11800, 92.72316085885252
[READ], 11900, 94.57730010629503
[READ], 12000, 91.04089401940317
[READ], 12100, 109.53773452814337
[READ], 12200, 92.54846983386767
[READ], 12300, 92.46350802994799
[READ], 12400, 91.04388837940522
[READ], 12500, 120.90603233013536
[READ], 12600, 92.5909090909091
[READ], 12700, 92.8135435452906
[READ], 12800, 92.99148517145505
[READ], 12900, 120.19630861540469
[READ], 13000, 92.81138979049867
[READ], 13100, 93.78113579673995
[READ], 13200, 92.77491849091756
[READ], 13300, 92.46676234588035
[READ], 13400, 105.91314231022312
[READ], 13500, 92.98973102281347
[READ], 13600, 93.57643035186366
[READ], 13700, 92.89729667282809
[READ], 13800, 94.75537228481821
[READ], 13900, 93.63254101940234
[READ], 14000, 113.15955236882664
[READ], 14100, 95.1549245994345
[READ], 14200, 93.20215786484951
[READ], 14300, 121.73497498538107
[READ], 14400, 95.99457451200094
[READ], 14500, 99.09058740268931
[READ], 14600, 131.0331696259917
[READ], 14700, 99.94067067927773
[READ], 14800, 95.35748281332629
[READ], 14900, 101.45994593930459
[READ], 15000, 96.42904564315353
[READ], 15100, 95.54225764857578
[READ], 15200, 101.55022816778146
[READ], 15300, 95.9756228075391
[READ], 15400, 99.67046087225488
[READ], 15500, 96.14241651343497
[READ], 15600, 99.49141908101126
[READ], 15700, 96.75411966215817
[READ], 15800, 102.01334084930477
[READ], 15900, 96.26117940495278
[READ], 16000, 99.88196517412935
[READ], 16100, 97.23061212230432
[READ], 16200, 98.35606950714242
[READ], 16300, 96.64095079232693
[READ], 16400, 96.68951733190144
[READ], 16500, 110.42611242054139
[READ], 16600, 96.75712323039245
[READ], 16700, 104.8796568627451
[READ], 16800, 106.20865458081545
[READ], 16900, 102.99632119751364
[READ], 17000, 97.11595070001196
[READ], 17100, 96.46167484191241
[READ], 17200, 101.18209587930927
[READ], 17300, 97.45066379619662
[READ], 17400, 99.96430577223089
[READ], 17500, 97.44090448063957
[READ], 17600, 96.87882798868901
[READ], 17700, 96.90039050765996
[READ], 17800, 95.13490314348684
[READ], 17900, 94.74248396775901
[READ], 18000, 97.93942284760315
[READ], 18100, 99.17665615141956
[READ], 18200, 99.13916777549292
[READ], 18300, 96.28318247990379
[READ], 18400, 105.7835266678942
[READ], 18500, 96.90431363203051
[READ], 18600, 97.21645253390436
[READ], 18700, 97.2220364287847
[READ], 18800, 96.79468781470293
[READ], 18900, 139.85924306393244
[READ], 19000, 97.30647585833684
[READ], 19100, 96.75561731315042
[READ], 19200, 97.56256297789106
[READ], 19300, 97.1467121402501
[READ], 19400, 96.65902765440872
[READ], 19500, 97.117202041429
[READ], 19600, 96.7706481810641
[READ], 19700, 96.98229824770533
[READ], 19800, 97.23014317115191
[READ], 19900, 97.46986941416078
[READ], 20000, 96.15368145592959
[READ], 20100, 95.60333539221742
[READ], 20200, 122.38402339541327
[READ], 20300, 95.75430568795679
[READ], 20400, 103.89029846172703
[READ], 20500, 104.62650750676839
[READ], 20600, 101.17030999135483
[READ], 20700, 99.22578199052133
[READ], 20800, 124.22403955876759
[READ], 20900, 100.86698424331257
[READ], 21000, 101.8918768545994
[READ], 21100, 124.92845642282114
[READ], 21200, 99.594555353902
[READ], 21300, 104.11430584016394
[READ], 21400, 98.81745841809261
[READ], 21500, 99.03552047360631
[READ], 21600, 109.17612999626448
[READ], 21700, 99.21243686868686
[READ], 21800, 107.63530720731858
[READ], 21900, 106.35830065359477
[READ], 22000, 99.39470047467404
[READ], 22100, 96.11005110732539
[READ], 22200, 131.278121587186
[READ], 22300, 99.29576614120916
[READ], 22400, 106.10258554154875
[READ], 22500, 99.81979116658665
[READ], 22600, 103.84737484737485
[READ], 22700, 99.8030082484231
[READ], 22800, 103.82793662816385
[READ], 22900, 105.24110417605044
[READ], 23000, 100.33248175182482
[READ], 23100, 104.63972107438016
[READ], 23200, 100.16730570263526
[READ], 23300, 106.42549647661755
[READ], 23400, 100.44074074074074
[READ], 23500, 100.2097052657541
[READ], 23600, 109.50054441811311
[READ], 23700, 100.71911557542721
[READ], 23800, 110.48857994041708
[READ], 23900, 120.57046026725195
[READ], 24000, 106.42855300490069
[READ], 24100, 100.12569247814847
[READ], 24200, 92.54386947132689
[READ], 24300, 144.33117773858515
[READ], 24400, 99.70748095266663
[READ], 24500, 104.88521727884118
[READ], 24600, 99.9715343529983
[READ], 24700, 99.16012558869701
[READ], 24800, 99.2466061971145
[READ], 24900, 98.90653981930234
[READ], 25000, 101.08066171587272
[READ], 25100, 99.20055794772273
[READ], 25200, 119.5401981265584
[READ], 25300, 135.63223257126728
[READ], 25400, 119.55332902391726
[READ], 25500, 121.54053320670239
[READ], 25600, 123.71500958641468
[READ], 25700, 115.952330648356
[READ], 25800, 106.20609871109714
[READ], 25900, 105.55471862549801
[READ], 26000, 103.1833140349808
[READ], 26100, 101.92711792766137
[READ], 26200, 100.40533164074897
[READ], 26300, 156.67116134060794
[READ], 26400, 103.41168823128831
[READ], 26500, 101.38216094198036
[READ], 26600, 101.72913075597144
[READ], 26700, 100.4588908981314
[READ], 26800, 100.54732336628888
[READ], 26900, 102.69138488314272
[READ], 27000, 116.34140435835351
[READ], 27100, 101.04601433735678
[READ], 27200, 99.88140715667312
[READ], 27300, 100.13874901413578
[READ], 27400, 149.5731166912851
[READ], 27500, 100.58012467913458
[READ], 27600, 100.32461017768645
[READ], 27700, 100.8622641509434
[READ], 27800, 100.50941105039466
[READ], 27900, 101.35848825081294
[READ], 28000, 99.95413843175218
[READ], 28100, 100.48220979536656
[READ], 28200, 100.21188023374903
[READ], 28300, 99.99570269943106
[READ], 28400, 121.45812095853937
[READ], 28500, 101.39644326155334
[READ], 28600, 122.4179730624862
[READ], 28700, 101.00598436736688
[READ], 28800, 105.10747191720309
[READ], 28900, 100.88923433308949
[READ], 29000, 101.78968944099378
[READ], 29100, 100.26345968131338
[READ], 29200, 103.14043702430641
[READ], 29300, 108.18726396666233
[READ], 29400, 100.17191004425047
[READ], 29500, 100.18968244311961
[READ], 29600, 100.7412272699629
[READ], 29700, 100.27033639143731
[READ], 29800, 101.49797396856582
[READ], 29900, 100.3349628824914
[READ], 30000, 100.43931758848886
[READ], 30100, 99.74684842270342
[READ], 30200, 98.66092636579573
[READ], 30300, 115.88642388726106
[READ], 30400, 101.05645508834574
[READ], 30500, 96.43753055380962
[READ], 30600, 133.4557484441533
[READ], 30700, 100.4869501733893
[READ], 30800, 99.57294159885113
[READ], 30900, 100.93920489296636
[READ], 31000, 110.20250636920747
[READ], 31100, 135.2241391501096
[READ], 31200, 100.92626219250353
[READ], 31300, 102.80884548395123
[READ], 31400, 100.70949517040277
[READ], 31500, 103.39567725253596
[READ], 31600, 103.42222635197919
[READ], 31700, 102.77109028120375
[READ], 31800, 102.73560112980473
[READ], 31900, 119.35914511382995
[READ], 32000, 113.76463488231744
[READ], 32100, 102.591662603608
[READ], 32200, 109.14841755997958
[READ], 32300, 102.12087643062611
[READ], 32400, 105.24015698189645
[READ], 32500, 101.84820714681099
[READ], 32600, 101.67045605637549
[READ], 32700, 120.24107874543694
[READ], 32800, 110.10788833397362
[READ], 32900, 106.13212760612912
[READ], 33000, 107.14165805785125
[READ], 33100, 104.1733032807413
[READ], 33200, 103.36096184846856
[READ], 33300, 114.67781900092753
[READ], 33400, 104.03187176448574
[READ], 33500, 112.8857469102633
[READ], 33600, 138.99768570362076
[READ], 33700, 105.18074357789078
[READ], 33800, 103.45428589162684
[READ], 33900, 111.07208327877439
[READ], 34000, 104.03716363184388
[READ], 34100, 109.08667305848513
[READ], 34200, 104.95074723846653
[READ], 34300, 109.69967121901871
[READ], 34400, 110.38522053133866
[READ], 34500, 103.59048852701703
[READ], 34600, 111.74557536680045
[READ], 34700, 103.59790769230769
[READ], 34800, 105.88982719524591
[READ], 34900, 133.6828819353142
[READ], 35000, 106.78345992666317
[READ], 35100, 110.1936047964027
[READ], 35200, 105.96857845920879
[READ], 35300, 124.08643115523743
[READ], 35400, 105.99911319440045
[READ], 35500, 101.97063511525258
[READ], 35600, 107.47832424895424
[READ], 35700, 112.63421544008757
[READ], 35800, 117.26121655153914
[READ], 35900, 110.25241405948242
[READ], 36000, 120.68839352259639
[READ], 36100, 111.54003944773176
[READ], 36200, 108.26875878818868
[READ], 36300, 105.32303388249922
[READ], 36400, 104.4492565055762
[READ], 36500, 105.01799913702767
[READ], 36600, 115.73723821989529
[READ], 36700, 113.59294913490308
[READ], 36800, 110.71962379257752
[READ], 36900, 110.40115900507878
[READ], 37000, 156.01511954992966
[READ], 37100, 135.50328656301352
[READ], 37200, 106.48285785785785
[READ], 37300, 106.50015473169525
[READ], 37400, 105.62630322823766
[READ], 37500, 105.00194259932323
[READ], 37600, 113.14922957399975
[READ], 37700, 105.50024878716258
[READ], 37800, 105.97823625613285
[READ], 37900, 105.01830057304825
[READ], 38000, 106.39982353311905
[READ], 38100, 104.69764139293653
[READ], 38200, 104.92788283277716
[READ], 38300, 104.43355755806574
[READ], 38400, 125.15881386111492
[READ], 38500, 103.6289816904941
[READ], 38600, 109.11900417101147
[READ], 38700, 102.02447527053526
[READ], 38800, 120.98355050961166
[READ], 38900, 131.01228820027475
[READ], 39000, 107.36541353383458
[READ], 39100, 106.87890207901513
[READ], 39200, 116.05145881206045
[READ], 39300, 107.08516397054196
[READ], 39400, 113.9954045954046
[READ], 39500, 106.8161584407419
[READ], 39600, 109.54988640051931
[READ], 39700, 107.32248930279385
[READ], 39800, 108.93228315576181
[READ], 39900, 107.39639126305794
[READ], 40000, 111.09685591789008
[READ], 40100, 106.97270409749424
[READ], 40200, 111.00006556947085
[READ], 40300, 107.01920533971412
[READ], 40400, 112.32538810276137
[READ], 40500, 140.29883492207597
[READ], 40600, 109.07007749901484
[READ], 40700, 106.98305084745763
[READ], 40800, 109.51026317482787
[READ], 40900, 106.98878236483402
[READ], 41000, 116.15068777217115
[READ], 41100, 112.16238685886691
[READ], 41200, 115.28358104318565
[READ], 41300, 110.38318936877076
[READ], 41400, 106.8985698985699
[READ], 41500, 116.56672097156398
[READ], 41600, 110.74507294599437
[READ], 41700, 114.47649402390438
[READ], 41800, 139.19926008139106
[READ], 41900, 110.53447368421052
[READ], 42000, 127.67211432759252
[READ], 42100, 111.0195572193894
[READ], 42200, 116.48351271680264
[READ], 42300, 109.43794381951864
[READ], 42400, 108.1593734145104
[READ], 42500, 127.59035292453497
[READ], 42600, 111.31216121420827
[READ], 42700, 113.10944436970267
[READ], 42800, 109.5065100031756
[READ], 42900, 120.22024698059438
[READ], 43000, 111.34162808641975
[READ], 43100, 117.37678547590441
[READ], 43200, 111.94634644864588
[READ], 43300, 110.3241744230524
[READ], 43400, 117.58248595129783
[READ], 43500, 109.76956076322192
[READ], 43600, 111.24176346715576
[READ], 43700, 112.4585152838428
[READ], 43800, 136.32430495844082
[READ], 43900, 126.99031245736117
[READ], 44000, 108.6333856694262
[READ], 44100, 128.59275068224756
[READ], 44200, 109.7802155749729
[READ], 44300, 115.2166915659378
[READ], 44400, 110.67572591500544
[READ], 44500, 115.59090598757425
[READ], 44600, 111.58468025298664
[READ], 44700, 118.70005406866721
[READ], 44800, 111.7313212866846
[READ], 44900, 107.54119129742638
[READ], 45000, 117.95050149798098
[READ], 45100, 109.53081295101859
[READ], 45200, 118.44784488582624
[READ], 45300, 110.95640292341913
[READ], 45400, 116.67178751877645
[READ], 45500, 110.88309697201993
[READ], 45600, 108.74302636606802
[READ], 45700, 116.89068286179825
[READ], 45800, 108.12800763844685
[READ], 45900, 106.58152985074626
[READ], 46000, 112.75217278505643
[READ], 46100, 115.60251018530687
[READ], 46200, 108.02854437229438
[READ], 46300, 130.5976059527661
[READ], 46400, 109.68816863961511
[READ], 46500, 108.07508677481052
[READ], 46600, 135.7022069570301
[READ], 46700, 120.66186266974123
[READ], 46800, 110.07304083185392
[READ], 46900, 109.79425594103444
[READ], 47000, 107.7970879223446
[READ], 47100, 113.26351046698873
[READ], 47200, 109.16161489120866
[READ], 47300, 108.43441742974424
[READ], 47400, 119.50103199174407
[READ], 47500, 108.76333940655908
[READ], 47600, 121.6360845351992
[READ], 47700, 109.33966084535561
[READ], 47800, 107.6624498997996
[READ], 47900, 107.34392628807822
[READ], 48000, 109.29270142180094
[READ], 48100, 107.47378894347366
[READ], 48200, 107.371385655276
[READ], 48300, 107.73922226363523
[READ], 48400, 107.6057064710636
[READ], 48500, 108.27861879144251
[READ], 48600, 108.71595404030892
[READ], 48700, 108.66009448818897
[READ], 48800, 107.37298975473456
[READ], 48900, 105.91193025809994
[READ], 49000, 124.53349573690622
[READ], 49100, 107.56499592502037
[READ], 49200, 117.82285172133369
[READ], 49300, 106.84273298230032
[READ], 49400, 108.96985274897621
[READ], 49500, 148.91278037229495
[READ], 49600, 107.57185835161391
[READ], 49700, 106.8905491457033
[READ], 49800, 107.88185999621952
[READ], 49900, 108.68363819221824
[READ], 50000, 107.56017326888066
[READ], 50100, 108.64647423724522
[READ], 50200, 108.09121579407721
[READ], 50300, 106.51695599515543
[READ], 50400, 126.41159322033899
[READ], 50500, 107.53733224119463
[READ], 50600, 109.5356820234869
[READ], 50700, 107.85849592725896
[READ], 50800, 106.26757243005149
[READ], 50900, 129.1289082711213
[READ], 51000, 107.59891905480141
[READ], 51100, 107.22437883290131
[READ], 51200, 107.21719824890556
[READ], 51300, 107.86303191489361
[READ], 51400, 107.58320745216515
[READ], 51500, 107.72996581845803
[READ], 51600, 106.91009975062344
[READ], 51700, 107.39808455673871
[READ], 51800, 135.6160447761194
[READ], 51900, 106.95045244573815
[READ], 52000, 107.39789420591387
[READ], 52100, 107.64007036501853
[READ], 52200, 107.72996292982232
[READ], 52300, 119.29528954921493
[READ], 52400, 106.49112651866929
[READ], 52500, 107.5466557086863
[READ], 52600, 108.47421503330162
[READ], 52700, 131.1336023477623
[READ], 52800, 108.39271872418833
[READ], 52900, 107.68848530710052
[READ], 53000, 109.20132097040518
[READ], 53100, 108.97783126425134
[READ], 53200, 105.37986521798928
[READ], 53300, 122.3692750772689
[READ], 53400, 107.38716395304809
[READ], 53500, 106.98770851624232
[READ], 53600, 106.83158420789606
[READ], 53700, 107.58865248226951
[READ], 53800, 107.17067217423958
[READ], 53900, 107.4262192449759
[READ], 54000, 107.9942449643438
[READ], 54100, 107.85094471658502
[READ], 54200, 107.22084069679374
[READ], 54300, 110.33464817406795
[READ], 54400, 106.89726413322482
[READ], 54500, 104.76089039581338
[READ], 54600, 144.69294946317444
[READ], 54700, 105.19142816050626
[READ], 54800, 129.47426398268965
[READ], 54900, 107.57316996544141
[READ], 55000, 108.11739374648943
[READ], 55100, 110.39665573770492
[READ], 55200, 116.78058162794277
[READ], 55300, 131.96946091272576
[READ], 55400, 108.10788381742739
[READ], 55500, 108.17044228694714
[READ], 55600, 107.29172166698095
[READ], 55700, 107.73258356763512
[READ], 55800, 107.19904558583448
[READ], 55900, 106.15591927147427
[READ], 56000, 106.04533052213816
[READ], 56100, 108.50408305374438
[READ], 56200, 104.18745451899287
[READ], 56300, 130.12864775996712
[READ], 56400, 135.22350743587901
[READ], 56500, 106.06499783134024
[READ], 56600, 106.3374653913919
[READ], 56700, 105.68400222620741
[READ], 56800, 106.11450096507066
[READ], 56900, 107.90404646171328
[READ], 57000, 106.8071565653439
[READ], 57100, 106.21064287522147
[READ], 57200, 107.60740556040393
[READ], 57300, 106.23657337367625
[READ], 57400, 107.02114803625378
[READ], 57500, 105.64480568011957
[READ], 57600, 107.57021438538628
[READ], 57700, 104.49374588545095
[READ], 57800, 125.96901826631382
[READ], 57900, 107.38690587429141
[READ], 58000, 106.63110283357723
[READ], 58100, 127.34818026540533
[READ], 58200, 102.4382253260758
[READ], 58300, 143.1900122588554
[READ], 58400, 107.52954531121902
[READ], 58500, 107.1216005001563
[READ], 58600, 106.71885786005647
[READ], 58700, 106.59209377727896
[READ], 58800, 106.56224014111125
[READ], 58900, 106.69300534227854
[READ], 59000, 106.47741975615826
[READ], 59100, 107.55209845377091
[READ], 59200, 103.39352191118276
[READ], 59300, 133.9155755325386
[READ], 59400, 107.1752853845674
[READ], 59500, 107.44006784771956
[READ], 59600, 106.86187149959096
[READ], 59700, 106.16792842395044
[READ], 59800, 107.47842162299993
[READ], 59900, 106.68663475223185
[CLEANUP], Operations, 32
[CLEANUP], AverageLatency(us), 413.125
[CLEANUP], MinLatency(us), 141
[CLEANUP], MaxLatency(us), 643
[CLEANUP], 0, 413.125
java -cp /data/joao/repos/bits/ycsb/work/src/YCSB/hbase/src/main/conf:/data/joao/repos/bits/ycsb/work/src/YCSB/accumulo/src/main/conf:/data/joao/repos/bits/ycsb/work/src/YCSB/nosqldb/src/main/conf:/data/joao/repos/bits/ycsb/work/src/YCSB/core/target/core-0.1.4.jar:/data/joao/repos/bits/ycsb/work/src/YCSB/jdbc/src/main/conf:/data/joao/repos/bits/ycsb/work/src/YCSB/gemfire/src/main/conf:/data/joao/repos/bits/ycsb/work/src/YCSB/dynamodb/conf:/data/joao/repos/bits/ycsb/work/src/YCSB/infinispan/src/main/conf:/data/joao/repos/bits/ycsb/work/src/YCSB/cassandra/target/cassandra-binding-0.1.4.jar:/data/joao/repos/bits/ycsb/work/src/YCSB/cassandra/target/archive-tmp/cassandra-binding-0.1.4.jar:/data/joao/repos/bits/ycsb/work/src/YCSB/voldemort/src/main/conf com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.CassandraClient10 -P workloads/workloada -p cassandra.connectionretries=10 -p fieldlength=10 -p updateretrycount=100 -p cassandra.operationretries=10 -p recordcount=50000000 -p reconnectiontime=1000 -p fieldcount=10 -p timeseries.granularity=100 -p threadcount=32 -p insertretrycount=10 -p readretrycount=1000 -p ignoreinserterrors=true -p hosts=f1,f2,f3,f4 -p maxexecutiontime=60 -p measurementtype=timeseries -p exportmeasurementsinterval=30000 -p operationcount=60000000 -t